; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v5 ?v13)
             (pred_1 ?v9 ?v7)
             (pred_12 ?v5 ?v7)
             (pred_10 ?v10 ?v5 )
	     (pred_8 ?v5)
             (pred_3 ?v1)
             (pred_11 ?v9)
             (pred_7 ?v7)
             (pred_5 ?v5)
             (pred_4 ?v9)
             (pred_2 ?v5)
             (pred_9 ))



(:action op_3
:parameters (?v2 ?v4 ?v8 ?v12)
:precondition (and (pred_3 ?v2) (pred_3 ?v4) (pred_11 ?v8) (pred_7 ?v12)
          (pred_6 ?v2 ?v4) (pred_1 ?v8 ?v12)
                   (pred_12 ?v4 ?v12) (pred_8 ?v2) 
                   (pred_5 ?v4) (pred_4 ?v8))
:effect (and  (pred_2 ?v4) (not (pred_5 ?v4))))


(:action op_2
:parameters (?v2 ?v11)
:precondition (and (pred_3 ?v2) (pred_3 ?v11)
               (pred_8 ?v2) (pred_6 ?v2 ?v11) (pred_2 ?v11))
:effect (and (pred_8 ?v11) (not (pred_8 ?v2))))

(:action op_1
:parameters (?v2 ?v8)
:precondition (and (pred_3 ?v2) (pred_11 ?v8) 
                  (pred_8 ?v2) (pred_10 ?v8 ?v2) (pred_9 ))
:effect (and (pred_4 ?v8)
   (not (pred_10 ?v8 ?v2)) (not (pred_9 ))))


(:action op_4
:parameters (?v2 ?v3 ?v6)
:precondition (and (pred_3 ?v2) (pred_11 ?v3) (pred_11 ?v6)
                  (pred_8 ?v2) (pred_4 ?v6) (pred_10 ?v3 ?v2))
:effect (and (pred_4 ?v3) (pred_10 ?v6 ?v2)
        (not (pred_4 ?v6)) (not (pred_10 ?v3 ?v2))))

(:action op_5
:parameters (?v2 ?v8)
:precondition (and (pred_3 ?v2) (pred_11 ?v8) 
                  (pred_8 ?v2) (pred_4 ?v8))
:effect (and (pred_9 ) (pred_10 ?v8 ?v2) (not (pred_4 ?v8)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_15 obj_01 obj_14 obj_07 obj_30 obj_17 obj_32 obj_08 obj_04 obj_24 obj_12 obj_05 obj_26 obj_27 obj_06 obj_28 obj_31 obj_11 obj_21 obj_09 obj_23 obj_03 obj_29 obj_25 obj_19
    obj_22 obj_02 obj_20
    obj_18 obj_10 obj_16 obj_13
    )

    (:init
       (pred_9)

       (pred_3 obj_15)
       (pred_3 obj_01)
       (pred_3 obj_14)
       (pred_3 obj_07)
       (pred_3 obj_30)
       (pred_3 obj_17)
       (pred_3 obj_32)
       (pred_3 obj_08)
       (pred_3 obj_04)
       (pred_3 obj_24)
       (pred_3 obj_12)
       (pred_3 obj_05)
       (pred_3 obj_26)
       (pred_3 obj_27)
       (pred_3 obj_06)
       (pred_3 obj_28)
       (pred_3 obj_31)
       (pred_3 obj_11)
       (pred_3 obj_21)
       (pred_3 obj_09)
       (pred_3 obj_23)
       (pred_3 obj_03)
       (pred_3 obj_29)
       (pred_3 obj_25)
       (pred_3 obj_19)
       (pred_7 obj_22)
       (pred_7 obj_02)
       (pred_7 obj_20)
       (pred_11 obj_18)
       (pred_11 obj_10)
       (pred_11 obj_16)
       (pred_11 obj_13)

       (pred_6 obj_15 obj_17)
       (pred_6 obj_15 obj_01)
       (pred_6 obj_01 obj_32)
       (pred_6 obj_01 obj_14)
       (pred_6 obj_01 obj_15)
       (pred_6 obj_14 obj_08)
       (pred_6 obj_14 obj_07)
       (pred_6 obj_14 obj_01)
       (pred_6 obj_07 obj_04)
       (pred_6 obj_07 obj_30)
       (pred_6 obj_07 obj_14)
       (pred_6 obj_30 obj_24)
       (pred_6 obj_30 obj_07)
       (pred_6 obj_17 obj_12)
       (pred_6 obj_17 obj_32)
       (pred_6 obj_17 obj_15)
       (pred_6 obj_32 obj_05)
       (pred_6 obj_32 obj_08)
       (pred_6 obj_32 obj_01)
       (pred_6 obj_32 obj_17)
       (pred_6 obj_08 obj_26)
       (pred_6 obj_08 obj_04)
       (pred_6 obj_08 obj_14)
       (pred_6 obj_08 obj_32)
       (pred_6 obj_04 obj_27)
       (pred_6 obj_04 obj_24)
       (pred_6 obj_04 obj_07)
       (pred_6 obj_04 obj_08)
       (pred_6 obj_24 obj_06)
       (pred_6 obj_24 obj_30)
       (pred_6 obj_24 obj_04)
       (pred_6 obj_12 obj_28)
       (pred_6 obj_12 obj_05)
       (pred_6 obj_12 obj_17)
       (pred_6 obj_05 obj_31)
       (pred_6 obj_05 obj_26)
       (pred_6 obj_05 obj_32)
       (pred_6 obj_05 obj_12)
       (pred_6 obj_26 obj_11)
       (pred_6 obj_26 obj_27)
       (pred_6 obj_26 obj_08)
       (pred_6 obj_26 obj_05)
       (pred_6 obj_27 obj_21)
       (pred_6 obj_27 obj_06)
       (pred_6 obj_27 obj_04)
       (pred_6 obj_27 obj_26)
       (pred_6 obj_06 obj_09)
       (pred_6 obj_06 obj_24)
       (pred_6 obj_06 obj_27)
       (pred_6 obj_28 obj_23)
       (pred_6 obj_28 obj_31)
       (pred_6 obj_28 obj_12)
       (pred_6 obj_31 obj_03)
       (pred_6 obj_31 obj_11)
       (pred_6 obj_31 obj_05)
       (pred_6 obj_31 obj_28)
       (pred_6 obj_11 obj_29)
       (pred_6 obj_11 obj_21)
       (pred_6 obj_11 obj_26)
       (pred_6 obj_11 obj_31)
       (pred_6 obj_21 obj_25)
       (pred_6 obj_21 obj_09)
       (pred_6 obj_21 obj_27)
       (pred_6 obj_21 obj_11)
       (pred_6 obj_09 obj_19)
       (pred_6 obj_09 obj_06)
       (pred_6 obj_09 obj_21)
       (pred_6 obj_23 obj_03)
       (pred_6 obj_23 obj_28)
       (pred_6 obj_03 obj_29)
       (pred_6 obj_03 obj_31)
       (pred_6 obj_03 obj_23)
       (pred_6 obj_29 obj_25)
       (pred_6 obj_29 obj_11)
       (pred_6 obj_29 obj_03)
       (pred_6 obj_25 obj_19)
       (pred_6 obj_25 obj_21)
       (pred_6 obj_25 obj_29)
       (pred_6 obj_19 obj_09)
       (pred_6 obj_19 obj_25)
       (pred_5 obj_27)
       (pred_5 obj_04)
       (pred_5 obj_28)
       (pred_5 obj_06)
       (pred_12  obj_27 obj_22)
       (pred_12  obj_04 obj_02)
       (pred_12  obj_28 obj_20)
       (pred_12  obj_06 obj_02)
       (pred_2 obj_15)
       (pred_2 obj_01)
       (pred_2 obj_14)
       (pred_2 obj_07)
       (pred_2 obj_30)
       (pred_2 obj_17)
       (pred_2 obj_32)
       (pred_2 obj_08)
       (pred_2 obj_24)
       (pred_2 obj_12)
       (pred_2 obj_05)
       (pred_2 obj_26)
       (pred_2 obj_31)
       (pred_2 obj_11)
       (pred_2 obj_21)
       (pred_2 obj_09)
       (pred_2 obj_23)
       (pred_2 obj_03)
       (pred_2 obj_29)
       (pred_2 obj_25)
       (pred_2 obj_19)

       (pred_1  obj_18 obj_22)
       (pred_1  obj_10 obj_02)
       (pred_1  obj_16 obj_20)
       (pred_1  obj_13 obj_20)
       (pred_10 obj_18 obj_23)
       (pred_10 obj_10 obj_19)
       (pred_10 obj_16 obj_07)
       (pred_10 obj_13 obj_09)
       (pred_8 obj_29)
    )

    (:goal (and
       (pred_10 obj_13 obj_31)
    ))
(:constraints
  (always (not (pred_8 obj_21)))
)
)

; plan
1. (op_2 obj_29 obj_25)
   deleted: (pred_8 obj_29)
   added: (pred_8 obj_25)
   goals met: 0 of 1
2. (op_2 obj_25 obj_19)
   deleted: (pred_8 obj_25)
   added: (pred_8 obj_19)
   goals met: 0 of 1
3. (op_2 obj_19 obj_09)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_09)
   goals met: 0 of 1
4. (op_1 obj_09 obj_13)
   deleted: (pred_10 obj_13 obj_09) (pred_9)
   added: (pred_4 obj_13)
   goals met: 0 of 1
5. (op_2 obj_09 obj_19)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_19)
   goals met: 0 of 1
6. (op_2 obj_19 obj_25)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_25)
   goals met: 0 of 1
7. (op_2 obj_25 obj_29)
   deleted: (pred_8 obj_25)
   added: (pred_8 obj_29)
   goals met: 0 of 1
8. (op_2 obj_29 obj_11)
   deleted: (pred_8 obj_29)
   added: (pred_8 obj_11)
   goals met: 0 of 1
9. (op_2 obj_11 obj_31)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_31)
   goals met: 0 of 1
10. (op_5 obj_31 obj_13)
   deleted: (pred_4 obj_13)
   added: (pred_9) (pred_10 obj_13 obj_31)
   goals met: 1 of 1
